In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    "modelo": ["Uno,", "Monza", "Camaro", "Gol", "Palio"],
    "marca": ["Fiat", "Chevrolet", "Chevrolet", "VW", "Fiat"],
    "valor": [10000, 20000, 200000, 30000, 15000],
    "unidades": [10, 30, 100, 25, 15]
})
df

   modelo      marca   valor  unidades
0    Uno,       Fiat   10000        10
1   Monza  Chevrolet   20000        30
2  Camaro  Chevrolet  200000       100
3     Gol         VW   30000        25
4   Palio       Fiat   15000        15

# metodos descritivos

In [4]:
df.describe()

              valor    unidades
count       5.00000    5.000000
mean    55000.00000   36.000000
std     81394.10298   36.640142
min     10000.00000   10.000000
25%     15000.00000   15.000000
50%     20000.00000   25.000000
75%     30000.00000   30.000000
max    200000.00000  100.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   modelo    5 non-null      object
 1   marca     5 non-null      object
 2   valor     5 non-null      int64
 3   unidades  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [6]:
df.count()

modelo      5
marca       5
valor       5
unidades    5
dtype: int64

# Agrupamento de dados

In [7]:
df

   modelo      marca   valor  unidades
0    Uno,       Fiat   10000        10
1   Monza  Chevrolet   20000        30
2  Camaro  Chevrolet  200000       100
3     Gol         VW   30000        25
4   Palio       Fiat   15000        15

In [8]:
grupo = df.groupby("marca")
grupo.count()

           modelo  valor  unidades
marca
Chevrolet       2      2         2
Fiat            2      2         2
VW              1      1         1

In [9]:
grupo = df.groupby("marca")
grupo["marca"].count()

marca
Chevrolet    2
Fiat         2
VW           1
Name: marca, dtype: int64

In [10]:
grupo["modelo"].value_counts()

marca      modelo
Chevrolet  Camaro    1
           Monza     1
Fiat       Palio     1
           Uno,      1
VW         Gol       1
Name: modelo, dtype: int64

In [11]:
grupo["valor"].mean()

marca
Chevrolet    110000.0
Fiat          12500.0
VW            30000.0
Name: valor, dtype: float64

In [12]:
grupo["unidades"].sum()

marca
Chevrolet    130
Fiat          25
VW            25
Name: unidades, dtype: int64

# Valores Ãºnicos

In [13]:
df["marca"].unique()

array(['Fiat', 'Chevrolet', 'VW'], dtype=object)

In [14]:
df["marca"].nunique()

3

In [15]:
df["marca"].value_counts()

Fiat         2
Chevrolet    2
VW           1
Name: marca, dtype: int64